[
  {
    "label": "HTML5",
    "proficiency": 5,
    "type": "tech",
    "additionalInputs": [
      "HTML forms and multimedia integration.",
      "Accessible web application development.",
      "Better SEO for page by using appropriate page elements."
    ],
    "hidden": false
  },
  {
    "label": "CSS3",
    "proficiency": 5,
    "type": "tech",
    "additionalInputs": [
      "Theming using CSS variables.",
      "Media queries for responsive layout/targeting required devices.",
      "CSS animations using key-frames.",
      "Backgrounds and gradients.",
      "Column, grid and flex layouts to achieve the desired structure."
    ],
    "hidden": false
  },
  {
    "label": "jQuery",
    "proficiency": 5,
    "type": "tech",
    "additionalInputs": [
      "Async programming i.e. AJAX requests, geo-location implementation etc.",
      "Site animations.",
      "Form validations with accessible implementation.",
      "Revealing or Hidden Module pattern implementation for large apps with modular dev approach.",
      "Basic DOM Manipulation for async operations."
    ],
    "hidden": false
  },
  {
    "label": "Bootstrap",
    "proficiency": 5,
    "type": "tech",
    "additionalInputs": [
      "Well versed with Bootstrap out of the box classes and usage to achieve the desired layout.",
      "Built fluid apps using Bootstrap.",
      "Built mobile first apps using Bootstrap."
    ],
    "hidden": false
  },
  {
    "label": "Responsive Web Development",
    "proficiency": 5,
    "type": "impl",
    "additionalInputs": [
      "Well versed with mobile first and fluid development approaches for web applications.",
      "Have used CSS frameworks like Bootstrap to create reusable responsive components.",
      "Well versed with custom media queries to target specific devices and relevant use-cases."
    ],
    "hidden": false
  },
  {
    "label": "Handlebars",
    "proficiency": 5,
    "type": "tech",
    "additionalInputs": [
      "Written handlebars template to generate demo pages for components generated in plain JS and jQuery.",
      "Used handlebars, jQuery and Grunt to generate component driven app using vanilla JS without any framework."
    ],
    "hidden": false
  },
  {
    "label": "Agile Methodologies",
    "proficiency": 5,
    "type": "impl",
    "additionalInputs": [
      "Well versed with Agile development methodologies.",
      "Developing using Agile since the beginning in 2-3 weeks sprint depending on projects.",
      "Comfortable in working with CI/CD and continuous releases at the end of sprints."
    ],
    "hidden": true
  },
  {
    "label": "LESS/SASS",
    "proficiency": 4.75,
    "type": "tech",
    "additionalInputs": [
      "Comfortable with CSS pre-processors like LESS and SASS.",
      "Have implemented base theme for applications using SASS and LESS.",
      "Well versed with features of pre-processors like mixins, functions a OOTB method to achieve desired theme and results."
    ],
    "hidden": false
  },
  {
    "label": "React 18",
    "proficiency": 4.5,
    "type": "tech",
    "additionalInputs": [
      "Developed large scale app using functional components in React.",
      "Well versed with component lifecycle and relevant hooks.",
      "Developed high performance apps using features like lazy-loading images and site bundles."
    ],
    "hidden": false
  },
  {
    "label": "Performance Optimization",
    "proficiency": 4.5,
    "type": "impl",
    "additionalInputs": [
      "Improved performance of web-apps by over 50% by splitting bundles and lazy-loading them.",
      "Implemented lazy loading on images and delay initialization on media elements to boost site performance.",
      "Implemented changes suggested by lighthouse console to boost site performance."
    ],
    "hidden": false
  },
  {
    "label": "Angular 10",
    "proficiency": 4.5,
    "type": "tech",
    "additionalInputs": [
      "Build large scale performant apps using Angular.",
      "Developed Mobile First Test Driven app using Angular.",
      "Built Component driven AA accessibility compliant app using Angular.",
      "Implemented state management using ngrx/store for large scale Angular App."
    ],
    "hidden": false
  },
  {
    "label": "Grunt/Gulp",
    "proficiency": 4.5,
    "type": "tech",
    "additionalInputs": [
      "Implemented task automation using Grunt and Gulp.",
      "Created automated task to generate component demo pages using handlebars and Grunt."
    ],
    "hidden": false
  },
  {
    "label": "Node JS",
    "proficiency": 4.25,
    "type": "tech",
    "additionalInputs": [
      "Implemented REST APIs using express and nodejs.",
      "Created basic app hosting server to test the developed components using express and Node.",
      "Created PDF download functionality for a medium scale app using PdfKit and NodeJS"
    ],
    "hidden": false
  },
  {
    "label": "Javascript (OOJS)",
    "proficiency": 4,
    "type": "tech",
    "additionalInputs": [
      "Async programming i.e. AJAX requests, geo-location implementation etc.",
      "Write code that is modular and clean to achieve the desired functionality.",
      "Depending on the need the code can be class driven or functional in nature.",
      "Well versed with modular pattern for Javascript to write self sufficient functional components."
    ],
    "hidden": false
  },
  {
    "label": "TypeScript",
    "proficiency": 4,
    "type": "tech",
    "additionalInputs": [
      "Capable of developing large scale apps using TypeScript.",
      "Well versed with development using TypeScript in modern frameworks like Angular and libraries like React."
    ],
    "hidden": false
  },
  {
    "label": "Git",
    "proficiency": 4,
    "type": "tech",
    "additionalInputs": [
      "Have used git and related offerings like Github, Bitbucket for efficient development in large teams.",
      "Comfortable creating branching strategies for projects, managing releases and managing hot-fix/patches."
    ],
    "hidden": false
  },
  {
    "label": "Webpack",
    "proficiency": 4,
    "type": "tech",
    "additionalInputs": [
      "Written custom bundling for a large scale project created using modular jQuery and Javascript components.",
      "Implemented lazy loading in webpack to achieve lower load times for app.",
      "Updated config to support multi-brand development having different theming in a single repo."
    ],
    "hidden": false
  },
  {
    "label": "Vue JS",
    "proficiency": 3.75,
    "type": "tech",
    "additionalInputs": [
      "Have used VueJS to create a web application for a large gaming entity in Canada.",
      "Implemented state management and persistence in Vue Components."
    ],
    "hidden": false
  },
  {
    "label": "Gatsby JS",
    "proficiency": 3.75,
    "type": "tech",
    "additionalInputs": [
      "Have used GatsbyJS to create vertical sliced micro-front-end based app in yarn workspaces."
    ],
    "hidden": false
  }
]