[
  {
    "organization": "Tata Consultancy Services Ltd.",
    "city": "Mumbai",
    "country": "India",
    "title": "Systems Engineer",
    "from": "2012-05-08T18:30:00.000Z",
    "to": "2014-10-21T18:30:00.000Z",
    "imgsrc": "/images/workex/tcs-logo.webp",
    "isCurrent": false,
    "summary": "Started out in the IT industry as a Full Stack Developer, because of interest in UI technologies, switched over to FE stack after 6 months. Worked as an individual contributor in a larger team, collaborated well, and developed solutions that were praised by stakeholders.",
    "tasks": [
      "Developed creative solutions which received appreciations from involved stakeholders.",
      "Developed Single Page Applications using JS, jQuery, XSLT, CSS3, HTML5 and FE MVC Frameworks like Angular JS and Backbone.",
      "Contributed as developer on full stack project involving J2EE, Struts2, AJAX and MySQL."
    ]
  },
  {
    "organization": "Oracle Financial Services Software Ltd.",
    "city": "Mumbai",
    "country": "India",
    "title": "Applications Engineer",
    "from": "2014-11-01T18:30:00.000Z",
    "to": "2015-10-21T18:30:00.000Z",
    "imgsrc": "/images/workex/ofss-logo.jpg",
    "isCurrent": false,
    "summary": "First exposure on banking domain and related security layers. Understood mobile first development approach and web components.",
    "tasks": [
      "Involved in development of functional modules from inception to completion.",
      "Created reusable web-components, based on material design guidelines, using Polymer JS and Knockout JS.",
      "Created responsive, modular and scalable Single Page Application using web-components and Mobile First Fluid Layout Approach."
    ]
  },
  {
    "organization": "Deloitte",
    "city": "Mumbai",
    "country": "India",
    "title": "Consultant",
    "from": "2015-11-01T18:30:00.000Z",
    "to": "2017-12-02T18:30:00.000Z",
    "imgsrc": "/images/workex/ofss-logo.jpg",
    "isCurrent": false,
    "summary": "First exposure of CMS and integrating developed components in CMS of choice. Worked in multiple AEM projects as an individual contributor and later on lead FE developer.",
    "tasks": [
      "Took responsibility as lead developer and created two responsive/fluid web portals for a leading pharmaceutical company.",
      "Created reusable components that can be easily integrated with a CMS of choice for a leading retail portal.",
      "Integrated multimedia platforms like Kaltura and Brightcove, and Maps API from Google and Bing to web portals.",
      "Created component driven, mobile first web application for a national governing body."
    ]
  },
  {
    "organization": "Accenture",
    "city": "Pune",
    "country": "India",
    "title": "Application Development Team Lead",
    "from": "2017-12-11T18:30:00.000Z",
    "to": "2018-10-26T18:30:00.000Z",
    "imgsrc": "/images/workex/ofss-logo.jpg",
    "isCurrent": false,
    "summary": "Handled and supervised larger teams as a Team Lead. Helped in team member's development, set up and reviewed application architecture as a Front End SME.",
    "tasks": [
      "Managed deliveries as Technology Lead.",
      "Completed project quality reviews as an SME for Front End. Gave actionable items to teams to improve code quality and performance.",
      "Created component driven messaging app using Angular 6 and web-sockets.",
      "Worked on project migration from older technologies to Angular 6 and micro-services."
    ]
  },
  {
    "organization": "Deloitte",
    "city": "Pune",
    "country": "India",
    "title": "Consultant",
    "from": "2018-11-09T18:30:00.000Z",
    "to": "2020-06-01T18:30:00.000Z",
    "imgsrc": "/images/workex/ofss-logo.jpg",
    "isCurrent": false,
    "summary": "Lead developer on projects. Handled application architecture and performance optimization for large scale apps in depth.",
    "tasks": [
      "Handled projects as lead developer.",
      "Created responsive web app for a leading electronics manufacturer using 3D rendering and interactions in browser (React + Three JS).",
      "Lead developer on a project for one of the leading gaming entities in Canada (VueJS + AEM).",
      "Created performance intensive web apps with page load times under 2 seconds.",
      "Converted page performance data to actionable items and improved page performance by over 50%."
    ]
  },
  {
    "organization": "Deloitte",
    "city": "Pune",
    "country": "India",
    "title": "Senior Consultant",
    "from": "2020-06-01T18:30:00.000Z",
    "imgsrc": "/images/workex/ofss-logo.jpg",
    "isCurrent": true,
    "summary": "Architect of Front End modules in project, leading team of FE developers towards succeful deliveries and personal growth. Developing appliations that are fluid, cross browser compatible, fast and accessible. Handling architecture and performance optimization for large scale apps in depth.",
    "tasks": [
      "Created base architecture of Front End Module for a large scale Web App to be integrated with CMS.",
      "Optimized bundle sizes for CSS and JS files by 30%, improving page load time (Webpack).",
      "Through timely quality checks and code reviews, ensured that web application is tech debt free and WCAG level AA compliant.",
      "Managed team of FE developers to deliver development stories in a timely manner with quality work.",
      "Converted performance data from Lighthouse report to actionable items to ensure that app is fast and meets performance benchmarks."
    ]
  }
]
